20220107183247-we_can_borrow_at_lower_interest_rates_thanks_to_the_euro.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-12-21 Wed 14:21 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>We can borrow at lower interest rates thanks to the Euro</title>
<meta name="author" content="Rémi Louf" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" /></head>
<body>
<div id="content" class="content">
<h1 class="title">We can borrow at lower interest rates thanks to the Euro</h1>
<dl class="org-dl">
<dt>tags</dt><dd><a href="20210512205304-euro.html#ID-f6592dcf-e288-4c9f-a231-2d4a9ea88501">Euro</a></dd>
</dl>

<p>
As the argument goes the commonon currency increases the liquidity of obligations on <i>secondary markets</i>,  which increases the demand and thus lowers the interest rate.
</p>

<p>
Greece is often cited as an example. In the 90s no one wanted to buy bonds in drachma and the introduction of the euro made it easier to resel them on the secondary market. South Korea has higher interest rates than the eurozone for instance. Even Germany.
</p>

<p>
<b>But</b> interest rates started to converge after Maastricht but before the introduction of the currency. So convergence might be due to hope in european solidatiry when it comes to sovereign debt. And hope in economic integration : for instance Germany suddenly has a bigger market. This hope completely plummeted after 2008 and we observed divergence again.
</p>

<p>
<b>Yes but</b> we are talking about bonds with distant maturity terms, and investors know they will be able to resell them in euros.
</p>

<p>
With different maturity.
</p>

<p>
<b>Ok</b> liquidity is a necessary condition for interest rates to go down. But since 2008 we know this is not a sufficient condition, so I am really wondering if convergence did not happen because of this promise.
</p>

<p>
Well interest rates are still lower than in 1997 for every country of the eurozone. Quantitative Easing increased liquidity on markets.
</p>

<p>
I would say this is rather due to Draghi's "whatever it takes", and QE means you get your money back even if country is on the verge of default. I am trying to disantangle the effect of the <i>existence</i> of the common currency and of the political atmosphere around it.
</p>

<p>
Hard to distinguish the two effects. Would Bank of Greece saved its country with "whatever it takes" ?
</p>

<p>
This implies effect of confidence in the currency itself.
</p>

<p>
Yes. But <b>note that the interest rates on British bonds is higher than in the eurozone</b>.
</p>

<p>
Ok, that's a good argument in favour of the currency itself since there is no reason to not trust the pound and/or Bank of England.
</p>

<div id="outline-container-org92ba91f" class="outline-2">
<h2 id="org92ba91f"><span class="todo TODO">TODO</span> Find a way to look at the interest rate vs liquidity</h2>
</div>
<div id="outline-container-org71f9618" class="outline-2">
<h2 id="org71f9618"><span class="todo TODO">TODO</span> Plot interest rates accross euro zone from 1980s to today</h2>
</div>
<div id="outline-container-org5efa5eb" class="outline-2">
<h2 id="org5efa5eb"><span class="todo TODO">TODO</span> check that QE inncreased liquidity in bond market.</h2>
</div>
<div id="outline-container-orgba5b75c" class="outline-2">
<h2 id="orgba5b75c"><span class="todo TODO">TODO</span> Check if the volume exchanged of bonds is linked to the interest rates and if so in what sense the causality acts.</h2>
</div>

<div id="outline-container-org9d2a3a5" class="outline-2">
<h2 id="org9d2a3a5">Links to this note</h2>
</div>
</div>
</body>
</html>